mesh_study_re100/base/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
/*
    default         Gauss linear;
    grad(p)         Gauss linear;
*/

    default 	     leastSquares;

  //default 	     cellMDLimited leastSquares 0.5;
  //default 	     cellMDLimited Gauss linear 1;

  //grad(U) 	     cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;

  //div(phi,U)      Gauss linear;
  //div(phi,U)      Gauss limitedLinearV 1;

  //div(phi,U)      bounded Gauss linearUpwindV default;
    div(phi,U)      bounded Gauss linearUpwindV grad(U);

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
//   default         Gauss linear corrected;    
     default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
//  default         corrected;
    default         limited 1;
}

// ************************************************************************* //
